In [1]:
import pandas as pd
data={"student":["Ali","Ayse","mehmet","fatma","Deniz"],"maths":[85,90,75,80,95],
      "Physics":[70,80,85,90,88],"chemistry":[65,75,70,60,92]}

my_framework=pd.DataFrame(data)
my_framework

  student  maths  Physics  chemistry
0     Ali     85       70         65
1    Ayse     90       80         75
2  mehmet     75       85         70
3   fatma     80       90         60
4   Deniz     95       88         92

In [3]:
my_framework["average"]=my_framework[["maths","Physics","chemistry"]].mean(axis=1) 

my_framework

  student  maths  Physics  chemistry    average
0     Ali     85       70         65  73.333333
1    Ayse     90       80         75  81.666667
2  mehmet     75       85         70  76.666667
3   fatma     80       90         60  76.666667
4   Deniz     95       88         92  91.666667

In [5]:
def the_highest_maths_note(my_framework):
    the_highest_note=my_framework.loc[0,"maths"]
    for item in my_framework.loc[1:,"maths"]:
        if item>the_highest_note:
            the_highest_note=item
    return the_highest_note
the_highest_maths_note(my_framework)

95

In [7]:
my_framework[my_framework["Physics"]>80]

  student  maths  Physics  chemistry    average
2  mehmet     75       85         70  76.666667
3   fatma     80       90         60  76.666667
4   Deniz     95       88         92  91.666667

In [9]:
my_framework[(my_framework["chemistry"]>70) & ( my_framework["chemistry"]<80)]

  student  maths  Physics  chemistry    average
1    Ayse     90       80         75  81.666667